Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: དགོན་པའམ། རིའམ། ཕུག་གམ། འཆག་སའི་གནས་སམ། ཁྱིམ་དུ་གཏོར་ན་མར་མེའི་ཕྲེང་བ་འབྱུང་བར་འགྱུར་ལ།
en: Similarly, if he casts the seeds around a monastery, a hermitage, a mountain, a cave, a recreation ground, or an inhabited house, the same row of lights will appear there too.

source: ཆུ་དང་ཡུངས་ཀར་གྱིས་མི་སྣང་བར་འགྱུར།
en: They will disappear if the water with mustard seeds is cast again.

source: གྲོང་ཁྱེར་གྱི་སྒོར་ཡུངས་ཀར་གཏོར་ན་གཏོར་བ་ཙམ་གྱི་མོད་ལ་དགྲ་ཐམས་ཅད་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་ཀྱི་གྲོང་ཁྱེར་མི་སྣང་བར་འགྱུར་རོ།
en: If he casts the mustard seeds at the gates of a city, the city will become invisible as soon as the seeds are cast. “

source: །གང་ན་ཕྱིར་རྒོལ་བ་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་གནས་པའི་གྲོང་ངམ། གྲོང་ཁྱེར་རམ། ཚལ་གྱི་ནང་ངམ། དགོན་པའི་གནས་སུ་གཏོར་ན་འབྲོག་དགོན་པ་འབྱུང་བར་འགྱུར་ལ།
en: If he casts the seeds toward any place where his enemies, enemy armies, opponents, or adversaries live—be it a village, town, grove, or wilderness—a great forest wilderness will magically appear there.

source: ཐམས་ཅད་ཕན་ཚུན་ངོ་མི་ཤེས་ནས་འཇིགས་ཤིང་སྐྲག་པ་ཆེན་པོས་རབ་ཏུ་འབྲོས་པར་བྱེད་དོ།
en: All the inhabitants will be unable to see one another and, seized with great fear, will perish.

source: །དགྲའི་ཚོགས་ཀྱི་ནང་དུ་གཏོར་ན་མཚོན་ཆ་ཐམས་ཅད་དང་། འགྱེད་པའི་གོ་ཆ་ཐམས་ཅད་མི་སྣང་ཞིང་གཅེར་བུར་འགྱུར་རོ།
en: If he casts the seeds in the midst of an enemy army, all the enemy’s weapons and fighting gear will disappear, rendering them naked.

source: །ཞལ་ཆེ་འགྱེད་པའི་ནང་དུ་གཏོར་ན་འགྱེད་ཟླ་གཙོ་བོ་དེ་གཅེར་བུར་འགྱུར་རོ།
en: If he casts the seeds in a court of law, the court officials will become naked.

source: །དགྲའི་སྟེང་དུ་གཏོར་ན་མེ་འབར་བ་འབྱུང་བར་འགྱུར་ཏེ།
en: If he sprinkles an enemy with the seeds, a blazing fire will appear.

source: དེ་དག་ལ་སོགས་པ་ཡིད་ལ་ཇི་ལྟར་བྱས་པའི་ལས་འབུམ་སྙེད་བྱེད་དོ།
en: In this way, the vidyā holder will be able to perform these and hundreds of thousands of other activities, whatever he has in mind. “

source: །དེ་ནས་ལས་རྒྱ་ཆེན་པོ་བྱེད་པར་འདོད་པའི་རིག་སྔགས་འཆང་གཙང་མ་ལེགས་པར་ཁྲུས་བྱས་པ་སྤོས་ཀྱིས་ལུས་བསྐུས་པ་དེས།
en: If the vidyā holder wants to perform great activities, he should purify himself ritually, take a bath, and anoint himself with fragrances.

source: ཡུངས་ཀར་དང་། ཏིལ་མར་གྱི་རྒྱལ་པོས་བསྐུས་པ་ལ་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་ནས། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་གཏོར་བར་བྱ།
en: He should use the mantra to incant mustard seeds smeared with the king of oils one hundred and eight times, and with them he should sprinkle an image of Noble Avalokiteśvara.

source: ཁྲོ་བོའི་རྒྱལ་པོས་ལན་བདུན་དབང་བསྐུར་ནས་ཕྱག་རྒྱ་བཅས་པའི་ལག་པས་རིལ་བུ་སྤྱི་བོར་བཞག་ལ་ཕྱེ་མས་གདབ་པར་བྱ།
en: He should consecrate the image by reciting the Krodharāja mantra seven times while displaying the mudrā.

source: ཏིལ་མར་གྱི་རྒྱལ་པོས་རྐང་པ་ལ་བྱུག་པར་བྱ།
en: He should place the pills on Noble Avalokiteśvara’s head and sprinkle them with the powder.

source: དོན་ཡོད་པའི་རྒྱལ་པོ་ལན་ཅིག་དྲན་པར་བྱ་སྟེ།
en: He should then anoint Noble Avalokiteśvara’s feet with the king of oils and mindfully repeat the Amogharāja just once.

source: ཡོངས་སུ་སྦྱང་བའི་ལས་ལྷན་ཅིག་བྱ་བ་ལེགས་པར་བྱས་པས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་གཟུགས་གཡོ་སྟེ་གར་དགའ་བར་འགྲོ་ལ།
en: As soon as this auspicious act of service has been performed, the image of Noble Avalokiteśvara will move.

source: གཟུགས་བརྙན་གང་དུ་འགྲོ་བ་དེ་ཉིད་དུ་རང་འགྲོའོ།
en: It will go where Noble Avalokiteśvara wants it to go, and the vidyā holder himself should follow it wherever it goes. “

source: །ལྷའི་སྟེང་དུ་གཏོར་ན་ལྷ་ལྷའི་གནས་ནས་འཕོ་ཞིང་གར་དགའ་བ་དེར་འགྲོའོ།
en: Similarly, if the vidyā holder casts the seeds upon an image of a god, the image will leave the temple and go wherever the vidyā holder wants it to.

source: །ཕྱེ་མས་ལྷའི་སྟེང་དུ་གཏོར་ལ་ཁྲོ་བོའི་རྒྱལ་པོ་ཧཱུཾ་ཞེས་བྱ་བ་མི་སྣང་བར་འགྱུར་རོ།
en: If the vidyā holder sprinkles the powder on the image while reciting the mantra of Krodharāja, the syllable hūṁ, the image will become invisible.

source: །ཏིལ་མར་གྱི་རྒྱལ་པོ་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་ལ་བདག་ཉིད་ཀྱི་པུས་མོ་དང་། བྱིན་པ་ལ་བསྐུས་ན་ནམ་མཁའ་ལ་འགྲོ་བར་འགྱུར་རོ།
en: If he incants the king of oils with the mantra one hundred and eight times and smears his knees and lower legs with it, he will float in the air.

source: །རྐང་མཐིལ་ལ་བསྐུས་ན་སའི་སྟེང་ན་རྐང་པ་སོར་བཞི་ཙམ་མི་རེག་གོ།
en: If he smears the soles of his feet, he will float at the height of four fingers, without his feet touching the ground.

source: །རྡོའི་སྟེང་དུ་རྐང་པ་བཞག་པ་དང་། རྐང་རྗེས་བྱུང་བའི་སྟེང་དུ་རྫ་མ་དང་།
en: If he places his feet upon a stone, he will leave a footprint there.

source: བུམ་པ་དང་། བུམ་བུ་བཞག་པའི་རྐུབ་ལ་བསྐུས་ན་སོར་བཞི་ཙམ་གྱི་ཚད་དུ་ནམ་མཁའ་ལ་འདུག་གོ།
en: If he smears a jar, pitcher, or pot with the oil, it will float in the air four fingers above the ground. “

source: །ཡུངས་ཀར་ལ་བཟླས་བརྗོད་བྱས་ནས་མེས་སྦྱིན་སྲེག་བྱས་པའི་ཐལ་བ་དེ་བླངས་ནས་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་ལ།
en: The vidyā holder should incant mustard seeds and, after offering them as homa, retrieve the ashes and incant them one hundred and eight times.

source: ཏིལ་མར་གྱིས་སྦྲུས་པ་ལ་ཁྲོ་བོའི་རྒྱལ་པོས་བརྒྱ་རྩ་བརྒྱད་དབང་བསྐུར་ནས་མིག་ལ་བསྐུས་ན་མིག་གསུམ་སྟོན་ཅིང་དབང་ཕྱུག་ཆེན་པོའི་གཟུགས་སུ་སྟོན་པར་བྱེད་དོ།
en: He should make ointment by mixing the ashes with oil, consecrate it with the Krodharāja mantra, and anoint his eyes with it. He will then develop a third eye and appear in the form of Maheśvara.

source: །ཐལ་བས་ལུས་ལ་བྱུགས་ན་ཚངས་པའི་གཟུགས་སུ་སྟོན་ཏོ།
en: If he sprinkles his body with the ashes, he will appear in the form of Brahmā.

source: །ཤིང་པ་ལ་ཤ་དང་པརྣ་ཤ་བསྲེས་པས་ལུས་བྱུགས་ན་སྲེད་མེད་ཀྱི་བུའི་སྟོབས་དང་། ཤུགས་དང་། གཟུགས་སུ་སྟོན་ཏོ།
en: If he smears his body with the ashes mixed with the shoots of flame-of-the-forest, he will appear in the form of Nārāyaṇa and exhibit the same strength and energy.

source: །ཏིལ་མར་ཆེན་པོས་ཁར་བསྐུས་ལ་ཐལ་བས་དཔྲལ་བར་ཐིག་ལེ་བྱས་ན་གཞོན་ནུའི་གཟུགས་སུ་སྟོན་ཏོ།
en: If he smears his face with the great oil and marks his forehead with a bindi made with the ashes, he can assume any shape at will. “

source: །ཡུངས་ཀར་གྱི་འབྲུ་ཁ་དོག་སྣ་ཚོགས་ཅན་ལ་ཏིལ་མར་ཆེན་པོ་བྱུགས་པས་བསྐུས་ལ་དོན་ཡོད་པའི་རྒྱལ་པོས་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱ།
en: The vidyā holder should daub some mustard seeds with the great oil and sprinkle dyes of various types and colors on them.

source: ཕྱག་རྒྱས་བརྒྱ་རྩ་བརྒྱད་དབང་བསྐུར་ཅིང་ཁྲོ་བོའི་རྒྱལ་པོས་བརྒྱ་རྩ་བརྒྱད་དབང་བསྐུར་ལ། དེ་ནས་དངུལ་གྱི་སྣོད་ཀྱི་ནང་དུ་གཞག །
en: He should incant them with the Amogharāja one hundred and eight times, consecrate them by displaying the mudrā and reciting the Krodharāja mantra one hundred and eight times, and then place them in a silver bowl.

source: དེ་ནས་ལས་ཐམས་ཅད་བྱེད་དེ་ནམ་མཁའ་ལ་གཏོར་ན་ནོར་བུ་དང་རིན་པོ་ཆེའི་ཆར་འབབ་པར་སྟོན་ཏོ།
en: He will be able to perform any activity. If he casts the seeds into the sky, he will produce a rain of precious jewels.

source: །དེ་བཞིན་གཤེགས་པ་མཆོད་པའི་ཚེ་ནམ་མཁའ་ལ་གཏོར་ན་མེ་ཏོག་གི་ཆར་སྣ་ཚོགས་འབབ་པར་འགྱུར།
en: If he casts the seeds into the sky while worshiping the tathāgatas, a rain of flowers will fall.

source: འདུས་པའི་ནང་དུ་ནམ་མཁའ་ལ་གཏོར་ན་འབྲས་བུ་དང་ནོར་གྱི་རྒྱུན་སྣ་ཚོགས་པ་སྟོན་ཏོ།
en: If he casts the seeds into the sky while attending a meeting, he will produce a variety of fruits.

source: །ཚལ་གྱི་ནང་དུ་གཏོར་ན་མེ་ཏོག་དང་འབྲས་བུ་སྣ་ཚོགས་པ་སྟོན་ཏོ།
en: If he casts the seeds in a forest, various fruits and flowers will appear.

source: །རི་ཕུག་ཏུ་གཏོར་ན་རྫས་དང་སྨན་སྣ་ཚོགས་སྟོན་ཏོ།
en: If he casts the seeds into a mountain cave, various medicinal substances will appear. “

source: །མཆོད་རྟེན་རྙིང་པའམ། གཙུག་ལག་ཁང་ངམ།
en: If he casts the seeds at an old caitya, in the yard of a monastery, or in a temple, they will become complete and perfect and will have all the necessary amenities.

source: ལྷའི་གནས་སུ་གཏོར་ན་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་གང་ཞིང་རྫོགས་པ་ཁང་པ་བཟང་པོ་ཡངས་པ་གནས་ཀྱི་མཆོག་སྟོན་ཏོ།
en: Large palaces, residences, and groves will appear.

source: །གྲོང་ཁྱེར་སྟོང་བར་གཏོར་ན་འཚོ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་ཤིང་ཡོངས་སུ་རྫོགས་པ་དང་། ཡུལ་གྱི་རྒྱལ་པོ་དང་། སླས་དང་། བཀྲབས་པ་དང་། མདུན་ན་འདོན་པ་དང་།
en: If he casts the seeds in an empty city, it will be provisioned with all the necessary facilities, each of them perfect.

source: བློན་པོ་དང་། སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དག་སྟོན་ཏོ།
en: It will become filled with people, including a king with a harem, royal priests, and ministers, as well as ordinary men, women, boys, and girls.

source: །ཡང་ཁྲོ་བོའི་རྒྱལ་པོའི་ཧཱུྃ་ཞེས་བྱ་བས་གཏོར་ན་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་སྟོན་ཏོ།
en: Furthermore, if he casts the seeds while reciting the mantra of Krodharāja, the syllable hūṁ, he will conjure an army with the four divisions. “

source: །དུར་ཁྲོད་ཀྱི་ནང་དུ་གཏོར་ན་ཤི་བའི་རུས་པ་གང་དང་གང་ལ་བབ་པ་དེ་དང་དེ་གང་དུ་སེམས་ཅན་དམྱལ་བའམ། དུད་འགྲོའི་སྐྱེ་གནས་སམ། གཤིན་རྗེའི་འཇིག་རྟེན་ནམ། ལྷ་མ་ཡིན་ནམ། ནམ་མཁའ་ལྡིང་ངམ། དྲི་ཟའམ། མིའམ་ཅིའམ། ལྟོ་འཕྱེ་ཆེན་པོའམ། བྱའམ།
en: If he casts the seeds into a charnel ground, a voice will come forth from the bones or skull of any dead person on whose bones or flesh the seeds fall.

source: ཉའམ། རུ་སྦལ་གྱི་རིགས་སུ་སྐྱེས་པའམ། ལྷའི་འཇིག་རྟེན་ནམ། སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེས་པ་དེའི་རུས་པའམ། ཐོད་པ་ལ་ཚིག་འབྱུང་བར་འགྱུར་ལ་གང་དུ་སྐྱེས་པ་དེའི་གཏམ་ཡང་སྨྲའོ།
en: The voice will announce into which realm it has fallen, whether it is the hells, the animal realm, the realm of Yama, or the realms of asuras, garuḍas, gandharvas, kinnaras, or mahoragas or if it has taken birth as a bird, fish, or a tortoise, in the gods’ realms, in a buddha field, or in any other place.

source: །གང་དང་གང་གི་སྐྱེ་གནས་སུ་སྐྱེས་པ་དེ་ཐམས་ཅད་སྨྲ་ལ་ཐབས་ཇི་ལྟར་བྱ་བ་དེ་སྨྲའོ།
en: The voice will tell him everything, including any means that will be of help.

source: །ཡུངས་ཀར་དེས་ཀྱང་རུས་གོང་འབྲེལ་པའམ། ཤི་བའི་རོའམ། རུས་པ་འཐོར་བ་ལ་བབ་ན་བབ་པ་ཙམ་གྱི་མོད་ལ་སེམས་ཅན་དམྱལ་བ་ལས་ཡོངས་སུ་ཐར་ནས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: As soon as the mustard seeds fall on the bones or the skeletal remains of dead people, they will be freed from the hell realms and reborn in the realm of Sukhāvatī. “

source: །ཟོང་བཀྲམ་པའི་ནང་དུ་གཏོར་ན་ཐམས་ཅད་མི་མངོན་པར་འགྱུར་རོ།
en: If he casts the seeds among any merchandise that is displayed, it will all become invisible.

source: །ནམ་མཁའ་ལ་གཏོར་ན་སྐར་མ་རྣམས་མི་མཐོང་བར་འགྱུར་རོ།
en: If he casts the seeds into the sky, the stars will become invisible.

source: །སྐྱེ་བོ་མང་པོའི་ནང་དུ་གཏོར་ན་ཐམས་ཅད་གཅེར་བུར་འགྱུར་རོ།
en: If he casts the seeds into a large crowd of people, they will all become naked.

source: །འདུས་པའི་ནང་དུ་གཏོར་ན་ཐམས་ཅད་བྲོ་རྡུང་བར་བྱེད་དོ།
en: If he casts the seeds when attending a meeting, all those present will start dancing.

source: །དགེ་འདུན་གྱི་ནང་དུ་གཏོར་ན་དགེ་སློང་ཐམས་ཅད་བསམ་གཏན་ཐོབ་པར་འགྱུར་རོ།
en: If he casts the seeds in the middle of an assembly of monks, all of them will attain meditative stability.

source: །ཚོགས་ཀྱི་གཙོ་བོ་ལ་གཏོར་ན་རྣལ་འབྱོར་སྤྱོད་པར་འགྱུར་རོ།
en: If he casts the seeds among the leaders of assemblies, they will become followers of Yogācāra.

source: །མཁའ་འགྲོ་མའི་ཚོགས་ཀྱི་ནང་དུ་གཏོར་ན་ཐམས་ཅད་བོང་བུ་དང་། ཝ་དང་། ཁྱིའི་གཟུགས་ཅན་དུ་འགྱུར་རོ།
en: If he casts the seeds among ḍākinīs, they will all assume the forms of donkeys, jackals, or dogs.

source: །སྦྱོར་མའི་སྒོར་གཏོར་ན་སྦྱོར་མ་ཐམས་ཅད་འབར་ལ་མ་ཧེའི་གཟུགས་ཅན་དུ་སྣང་ངོ་།
en: If he casts the seeds at the door of a yoginī temple, all the yoginīs there will emit flames and appear in the form of buffalo. “

source: །ཤི་བའི་སྟེང་དུ་གཏོར་ན་བྲོ་རྡུང་བར་བྱེད་དོ།
en: If he casts the seed upon a corpse, it will start dancing.

source: །ཐོད་པའི་སྟེང་དུ་གཏོར་ན་བྲོ་རྡུང་བར་བྱེད་ཅིང་རྒྱུག་ལ་ཕན་ཚུན་རྒྱུག་པར་བྱེད་དོ། །ལམ་གྱི་བཞི།
en: If he casts the seeds upon a skull, the skull will dance, moving about here and there.

source: མདོར་གཏོར་ན་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་ཐམས་ཅད་རང་གི་གཟུགས་ཀྱིས་མདུན་ན་ཉེ་བར་འཁོད་ལ་ཇི་སྲིད་འཚོའི་དབང་དུ་གྱུར་ནས་འཁོད་དོ།
en: If he casts the seeds at a crossroads, all the yakṣas, rākṣasas, and bhūtas will arrive in their own forms, and they will fall under and remain in the vidyā holder’s thrall for as long as he lives.

source: །ཉིན་གཅིག་བཞིན་བདག་ཉིད་ལ་གཏོར་ན་མཆོད་པ་ཆེན་པོའི་གནས་སུ་འགྱུར་ཏེ། གཞན་ཡང་རང་གི་བློ་རྣམས་ཀྱིས་ལས་འབུམ་སྙེད་བྱེད་དོ།
en: If he sprinkles himself with the seeds every day, he will become an object of great veneration and will be able to perform hundreds of thousands of other activities, whatever he has in mind. “

source: །དོན་ཡོད་པ་ཆེན་པོ་རྣམ་པར་འཕྲུལ་པའི་དཀྱིལ་འཁོར་སྒྱུ་མ་ལྟ་བུའི་ཆོ་གའོ།། །།འཕགས་པ་དོན་ཡོད་པའི་ཞགས་པའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ། བམ་པོ་བཅྭ་བརྒྱད་པ། དེ་ནས་དེའི་ཕྱིར་འགུགས་པ་ཆེན་པོ་དང་།
en: This concludes the illusion-like rite of the great amogha maṇḍala of miraculous display. “

source: ལག་ན་རྡོ་རྗེའི་གཟུགས་བསྟན་པའི་ཆོ་ག་བཤད་པར་བྱ་སྟེ། གང་གིས་ལྷ་རྣམས་མྱུར་དུ་འོང་བ་དང་། ཕྱག་ན་རྡོ་རྗེའི་གཟུགས་མྱུར་དུ་སྟོན་ཏོ། །རྡོ་རྗེའི་སྐུ་དང་སྟོབས་པོ་ཆེ། །རྟ་མགྲིན་དང་ནི་མགུལ་སྔོན་དང་། །དེ་བཞིན་རྟ་ནི་རྒོད་མའི་ཁ།
en: I will now teach the procedure of summoning whereby Vajrapāṇi appears in a visible form, and the deities will swiftly arrive.

source: །བདུད་རྩི་འཁྱིལ་ལྡན་གཟུགས་པོ་ཆེ། །ལོག་འདྲེན་རྣམས་ནི་རབ་འཇོམས་དང་། །ཁྲོ་རྒྱལ་དེ་བཞིན་འཇིགས་བྱེད་སྤྱན། །ཀི་ལི་ཀི་ལིའི་རྒྱལ་པོ་ཆེ། །ཁྲོ་བོ་ཆོལ་པ་སྟོབས་པོ་ཆེ། །དེ་བཞིན་རྡོ་རྗེ་ས་འོག་གཟུགས། །རྡོ་རྗེ་རྩེ་མོ་དེ་ཉིད་དང་། །ཀླུ་ཆེན་རབ་འཇོམས་སྤྱན་ཡངས་དང་། །སོག་མ་མེད་ནི་འདུལ་བ་དང་། །དེ་བཞིན་ཐིགས་ཁྲོ་ཁྲོས་ཆེན་དང་། །དེ་བཞིན་མཆེ་བ་གཙིགས་མཛད་དང་། །རྒྱལ་པོ་ཆེན་པོ་རྡོ་རྗེའི་སྒྲོག །ཀླུ་ཡི་དབང་པོ་སྟོབས་ཀྱིས་གནོན། །མགོན་པོ་གོས་སྔོན་གྱོན་པ་དང་། །དབྱུག་སྔོན་དགྲ་ལས་རྒྱལ་བ་དང་། །འཇིག་རྟེན་དབང་ཕྱུག་པདྨའི་ལྟེ། །ཕྱག་ན་པདྨ་པདྨ་ཕྱུག །དེ་བཞིན་འཇིགས་པ་བརྒྱད་སེལ་དང་།
en: Vajrapāṇi, in his vajra body of great strength, will promptly appear, as will other deities such as Hayagrīva, Nīlakaṇṭha, Vaḍabāmukha, the beautiful Amṛtakuṇḍalī who destroys vināyakas, the king Bhairava with three eyes, the great king Kelikila, Ucchuṣmakrodha of great strength in his form of Vajrapātāla, Vajraśekhara, Mahānāga, Pramardana, Viśālākṣa, Apalāla, Damaka, Bindu, Krodha and Mahākrodha with fangs protruding from their mouths, the great lord and nāga king Vajrasphoṭa, powerful and courageous, Lord Nīlāmbaradhara, Nīladaṇḍa who conquered the enemies, and the lokeśvaras Padmanābha, Padmapāṇi, and Padmeśvara, teachers of the world who remove the eight great fears. “

source: །དེ་བཞིན་མཆོད་རྟེན་འཇིག་རྟེན་བླ། །སྣ་ཚོགས་གཟུགས་ཏེ་བཟང་པོ་དང་། །སྲེད་མེད་བུ་དང་ཚངས་པ་དང་། །དྲག་པོ་དང་ནི་དབང་ཕྱུག་དང་། །ནག་པོ་ཆེན་པོ་གཞོན་ནུ་དང་། །གཤིན་རྗེ་དང་ནི་ཆུ་ལྷ་ཉིད། །ཉི་མ་དང་ནི་ཟླ་བ་དང་།
en: Various palaces will also appear, as will the gods Nārāyaṇa, Brahmā, Rudra, Nandikeśvara, Mahākāla, Kumāra, Yama, and Varuṇa.

source: །རྒྱུ་སྐར་སྒྲ་གཅན་མཇུག་རིངས་དང་། །དེ་བཞིན་གཟའ་དང་ལྷ་མ་ཡིན། །ནམ་མཁའ་ལྡིང་དང་མི་འམ་ཅི། །གནོད་སྦྱིན་སྲིན་པོ་ལྟོ་འཕྱེ་ཆེ། །འབྱུང་པོ་དཔལ་ལྡན་རྣམ་ཐོས་བུ།
en: Deities such as Soma, Āditya, the nakṣatras, Rāhu, Ketu, and the planets will appear, as will asuras, garuḍas, kinnaras, mahoragas, yakṣas, rākṣasas, and bhūtas.

source: །དེ་བཞིན་ཡུལ་སྐྱོང་མིག་མི་བཟང་། །འཕགས་སྐྱེས་དེ་ཉིད་མཐོང་བ་དང་། །མིའུ་ཐུང་དང་ནི་དྲང་སྲོང་གཟུགས།
en: The Four Great Kings Vaiśravaṇa, Dhṛtarāṣṭra, Virūpākṣa, and Virūḍhaka will appear in their true forms endowed with the five types of splendor.

source: །ནོར་བུ་བཟང་སྲས་གང་བ་དང་། །སྣ་ཚོགས་གཟུགས་ཅན་སྟོན་པ་དང་། །རྒྱལ་པོ་དང་ནི་དེད་དཔོན་དང་། །ཚོང་དཔོན་དེ་བཞིན་ཁྱིམ་བདག་དང་། །བྲམ་ཟེ་དང་ནི་རྒྱལ་རིགས་དང་།
en: Vāmana in his form of a ṛṣi, Maṇibhadra, Pūrṇabhadra, and Viśvarūpa will also appear; so too will kings, merchants, heads of industrial guilds, householders, brahmins, and kṣatriyas.

source: །དགེ་སྦྱོང་སྟག་དང་སེང་གེ་དང་། །ཁྱུ་མཆོག་དེ་བཞིན་ནགས་ཀྱི་ལྷ། །ཤིང་ལྷ་དེ་བཞིན་ལོ་ཏོག་ལྷ། །གང་གཱ་སི་ཏཱ་ཡ་མུ་ནཱ། །ཟླ་བ་སྐལ་ལྡན་རུ་སྦལ་ཉ།
en: The elephants and bulls among the monks, the deities of the forest, the deities of the trees, and the deities of the crops will appear, as will Gaṅgā, Śītā, Yamunā, Candrabhāgā, Kūrma, Matsya, Bhujaṅga, Kāpālin, and Bhargava.

source: །ལག་འགྲོ་དང་ནི་ཐོད་པ་ཅན། །སྐལ་ཡོད་དེ་བཞིན་འབྲས་བུ་དང་། །མེ་ཏོག་རྒྱལ་རླབས་ཆེན་པོ་དང་། །སྣ་ཚོགས་གཟུགས་དང་རྣམ་སྣ་ཚོགས། །དེ་ལྟར་དགུག་པ་བསྟན་པ་དང་།
en: Excellent fruits and flowers of various types and various forms will also appear.

source: །དེ་ལྟར་སླར་གཤེགས་གསོལ་བ་ཉིད།
en: In just the same manner in which they were summoned and caused to appear, so will they be dismissed. “

source: །སྦྱིན་སྲེག་དྲ་བ་འདི་ཉིད་ནི།
en: This rite is in reality an illusory homa, the supreme type of illusion.

source: །སྒྱུ་འཕྲུལ་རྨད་བྱུང་གསང་སྔགས་གྲུབ། །རྫས་གྲུབ་ནོར་བུ་ཏིལ་མར་གྲུབ།
en: It brings the accomplishment of the mantra, of the power substances, and of the jewel oil.

source: །དོན་ཡོད་ཞགས་པ་བསྒྲུབ་པའི་ཕྱིར། །དེ་ཉིད་དངོས་གྲུབ་རབ་སྟོན་པ། །མཆོད་རྟེན་དགོན་པ་གཙུག་ལག་ཁང་། །ལྷ་ཡི་གནས་དང་དེ་བཞིན་གྲོང་།
en: It reveals the nature of reality in order to bring the accomplishment of Amoghapāśa.

source: །གྲོང་ཁྱེར་ཉིད་དང་འབབ་ཆུའི་དངོ་། །མཚེའུ་དང་ལྟེང་ཀ་ཆུ་བོ་དང་། །རྫིང་དང་དེ་བཞིན་ཆར་འབབ་དང་། །འབྲུག་སྒྲོགས་དང་ནི་གློག་འགྱུ་དང་། །གཞན་ཡང་མེ་ནི་འབར་བ་དང་། །དུད་པའི་ཕུང་པོ་བདེ་འགྱེད་དང་།
en: The vidyā holder can conjure a caitya, the pleasant courtyard of a monastery, a temple, village, town, fountain, pond, water tank, river, or lotus pond, rain, the rumbling of the nāgas, a flash of lightning, blazing fire, billows of smoke, or soldiers fighting.

source: །སྐྱེས་བུ་གོ་ཆ་གྱོན་པ་དང་། །དེ་བཞིན་མཚོན་ཆ་སྣ་ཚོགས་མཐོང་། །ཁྱུ་མཐོང་གྲུབ་པ་མཐོང་བ་དང་།
en: He can conjure various weapons, armor, and large troops of men.

source: །དེ་ཉིད་རྨད་དུ་བྱུང་བ་སྟེ།
en: The ultimate reality can be revealed by a masterful display.

source: །རྫས་ཉུང་སྦྱར་བ་ཉུང་གྱུར་ཀྱང་། །དེ་ཉིད་དངོས་གྲུབ་བླ་ན་མེད། །སེམས་ཅན་རྣམས་ལ་ཕན་འཚལ་ནས། །བཅོམ་ལྡན་དེ་ཉིད་བདག་གིས་བཤད། །རིག་སྔགས་འཆང་རྣམས་བཀླགས་པས་འགྲུབ།
en: With a small amount of the power substance, one can attain the ultimate realization of truth with little hassle. “

source: །དབུལ་པོ་རྣམས་ནི་ནོར་འཐོབ་ཅིང་། །སྡང་བ་རྣམས་ནི་བྱམས་པར་བགྱིད། །མུ་སྟེགས་གཞན་རྣམས་དད་པར་བགྱིད། །མཁས་པ་རྣམས་ནི་དགའ་བར་བགྱིད། །གདུལ་དཀའ་རྣམས་ནི་ཐར་བར་འཚལ། །དགེ་སློང་རྣམས་ནི་བསམ་གཏན་ཐོབ། །ཏིང་འཛིན་བླ་ན་མེད་པ་ཐོབ། །ཆོས་འདོད་རྣམས་ནི་སངས་རྒྱས་མཐོང་། །སྡིག་པ་བྱེད་རྣམས་སྡིག་པ་འཇིག །མི་རིགས་བྱས་རྣམས་ཐར་པ་འཐོབ། །མཚམས་མེད་ལྔ་རྣམས་རྣམ་དག་དོན། །དབུགས་མ་ཕྱིན་རྣམས་དབུགས་འབྱིན་མཆོག །མ་དུལ་བ་རྣམས་དེ་བཞིན་འདུལ། །མ་བརྒལ་བ་རྣམས་སྒྲོལ་བའི་གྲུ།
en: I am telling the truth, O Lord, out of a desire to benefit sentient beings, to bring vidyā holders success in their study and practice, to help the poor acquire wealth, to inspire the wicked with love, to inspire faith in followers of other religions, to bring joy to scholars, and to liberate those difficult to tame.

source: །ཐར་པའི་ལམ་དུ་འགྲོ་བར་གནས། །མ་གྲོལ་ངན་འགྲོ་ཀུན་ལས་འགྲོལ། །སྡིག་པ་ཀུན་ལས་རྣམ་པར་གྲོལ། །ལུང་མ་བསྟན་པ་ལུང་སྟོན་བྱེད། །སྐྱོན་དང་དྲི་མ་སྡིག་པ་རྣམས།
en: I do this out of a desire to help monks attain the meditative concentrations and the supreme samādhi, to bring the buddhas’ doctrine to those who desire the Dharma, to eradicate the wrongdoings of evildoers, to liberate those who follow the wrong course, to purify the five acts of immediate retribution, to bring the supreme consolation to the inconsolable, to tame those difficult to tame, to ferry across those that have not yet crossed, to establish others on the path to liberation, to liberate those not yet liberated, to liberate beings from all their wrongdoings and unhappy destinies, to help those whose final awakening has not been prophesied obtain the prophecy, and to instantly exhaust all faults, impurities, and vices.

source: །ཐམས་ཅད་མོད་ལ་སྤོང་བགྱིད་དེ། །དེ་ལ་སོགས་པའི་ལས་རྣམས་ནི། །བཀླགས་པས་གྲུབ་པ་བགྱིད་པ་ལགས།
en: All these and similar feats can be accomplished through the study and practice of this rite. “

source: །འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་འདས། །དོན་གྱི་དངོས་གྲུབ་བླ་ན་མེད། །གང་དང་གང་དུ་སྦྱོར་བ་བགྱིད། །དགོས་པ་ཐམས་ཅད་འགྲུབ་པར་འགྱུར།
en: This rite brings ultimate success in all worldly and supramundane activities, activities that are successfully accomplished in alignment with the aim of the vidyā holder.

source: །ཡིད་ལ་བསམས་པ་འགྲུབ་པར་འགྱུར། །འདིར་ནི་ཡིད་ཀྱིས་རྣམ་བསམས་པ། །ཇི་ལྟར་ཡིད་ལ་འདོད་པ་དང་། །ཇི་ལྟར་ངོ་བོ་ཀུན་བསམས་པ། །དེ་ལྟར་རྣམ་འཕྲུལ་སྟོན་པར་བགྱི།
en: He should use his imagination when performing this rite; all that he imagines will appear as a magical display.

source: །ཚེས་གྲངས་རྒྱུ་སྐར་སྦྱར་མི་འཚལ། །སྨྱུང་བ་བགྱི་བ་མི་འཚལ་ཏེ།
en: For this procedure it is not relevant what lunar day or nakṣatra it is, nor is it necessary for the vidyā holder to observe the ritual fast.

source: །ཆོ་ག་ཇི་བཞིན་དུས་ཅི་བཞིན། །ཆོ་ག་རིག་སྔགས་རྒྱལ་པོ་བཟླས། །རིག་སྔགས་འཆང་བ་གཙང་གྱུར་ཅིང་། །ལེགས་པར་ཁྲུས་བགྱིས་གོས་གཙང་དག །
en: He should recite the mantra no matter what time it is, following the usual procedure that he purify himself ritually, bathe thoroughly, and put on clean clothes.

source: བགོས་པ་བདེན་པར་སྨྲ་བ་དང་། །བླ་མ་ལ་ནི་གུས་བྱེད་པ། །རྟག་ཏུ་བྱམས་པའི་སེམས་ལ་གནས། །སེམས་ཅན་ཀུན་ལ་བརྩེ་བའི་མཆོག །
en: He should speak the truth, obey his teacher, cultivate thoughts of loving kindness, and remain wholly dedicated to caring for all beings.

source: སྡོམ་ལ་གནས་ཤིང་ཚངས་པར་སྤྱོད། །ཆོས་མ་ཡིན་པ་སྤོང་བྱེད་པ།
en: He should practice restraint, maintain celibacy, and avoid anything that is nonvirtuous. “

source: །གལ་ཏེ་དེ་ཉིད་གྲུབ་འདོད་ན། །ཆང་དང་ཤ་དང་ཀུན་དོང་དང་། །འདྲེས་དང་ཟ་འཕྲོ་སྦགས་པ་སྤང་།
en: If the vidyā holder desires true accomplishment, he should abstain from alcohol, avoid foods that contain meat or onions, and avoid leftover food.

source: །སེམས་ཅན་ངན་པ་སུན་འབྱིན་པ། །རིག་སྔགས་རྐུ་དང་ཆོ་ག་རྐུ། །ཆོས་རྐུ་གསང་སྔགས་རྐུ་བ་དང་། །དེ་བཞིན་རྐུན་མོ་ཆོམ་རྐུན་དང་། །སེར་སྣ་རྟག་ཏུ་སྤང་བར་གྱིས།
en: He should always avoid people who are bad or corrupt, thieves of vidyās, thieves of rites, thieves of the Dharma, thieves of secret mantras, female thieves and robbers, and envious people.

source: །དེ་དག་ལ་ནི་དངོས་གྲུབ་མེད།
en: Such people cannot win accomplishment.

source: །མ་རུངས་པ་ཡིས་དམ་ཚིག་ཉམས། །ཡིད་གཅུགས་པ་ནི་མེད་པར་བྱེད། །སྡིག་པའི་ཆོས་ནི་ཀུན་དུ་སྤྱོད། །དེ་བཞིན་གཤེགས་པ་ཀུན་གྱིས་སྨད།
en: People who violate their samaya, are evil at heart, are perfidious, or follow sinful dharmas are decried by all tathāgatas.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་སྨད།
en: They are decried by all bodhisattvas.

source: །རྟག་ཏུ་ཆོས་ཀྱི་སྡོང་དུམ་འགྱུར། །ཤི་ནས་སེམས་ཅན་དམྱལ་བར་གཞོལ།
en: They will always be separated from the Dharma support and will end up in hell.

source: །རྟག་ཏུ་སྨད་པའི་གནས་སུ་འགྱུར། །དབུལ་པོ་ལུས་ནི་སྐམས་པ་དང་། །མཛེ་དང་ཁྱི་རྔོས་འདེབས་པ་དང་།
en: They will always be despised, their bodies will be emaciated, they will be poor, and they will develop leprosy and skin eruptions.

source: །སྡུག་བསྔལ་རྐུན་མ་ཆོས་སུན་འབྱིན།
en: They will always experience suffering. “

source: །ཆོས་རྐུ་བ་ཡི་ལུས་ཅན་ནི། །འཇིག་རྟེན་འདིར་ནི་བདེར་མི་འགྱུར། །འཇིག་རྟེན་ཕ་རོལ་ག་ལ་བདེ། །སེམས་ཅན་དམྱལ་བར་གཞོལ་བ་ཡིན།
en: Dharma violators and Dharma thieves will not experience happiness in this world and will inevitably fall into hell after they die.

source: །དེ་ལྟ་བས་ན་ཆེན་པོ་འདོད་པས་ནི་རྟག་ཏུ་དམ་པའི་ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བར་བྱ་ཞིང་རྟག་ཏུ་དཀོན་མཆོག་གསུམ་དང་། །ཕ་དང་མ་དང་བླ་མ་དང་། སྟོན་པ་ནི་སྐྱོབ་པ་དང་། སྐྱབས་དང་། དཔུང་གཉེན་མཛད་པ། སྟོན་པ། མཆོག་སྦྱིན་པ། དངོས་གྲུབ་དང་། མི་འཇིགས་པ་སྦྱིན་པ། རྒ་ཤི་ལས་ཐར་བར་བྱེད་པ། དབང་ཕྱུག་སྦྱིན་པ། ནོར་སྦྱིན་པ། ལོངས་སྤྱོད་སྦྱིན་པ། དང་བ་མཆོག་བསྐྱེད་པ་དེ་ཉིད་འཇིག་རྟེན་གྱི་བླ་མ། མགོན་པོ་འཇིག་རྟེན་དབང་ཕྱུག་ཆེན་པོ་དབང་ཕྱུག་མགོན་པོ། མཆོག་སྦྱིན་པར་མཛད་པ། གཟུགས་སྣ་ཚོགས་སྟོན་པར་མཛད་པ།
en: One should therefore always feel devotion to and have complete faith in the Three Jewels.
